OdDAI.Logical.op_Implicit~OdAnsiString
\details
Operator of conversion to OdAnsiString value.

OdDAI.Logical.op_ExclusiveOr(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
XOR operator implementation for Logical type (ISO 10303-11, 12.4.4).

OdDAI.Logical.op_LogicalOr(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
AND operator implementation for Logical type (ISO 10303-11, 12.4.3).

OdDAI.Logical.op_LogicalAnd(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
AND operator implementation for Logical type (ISO 10303-11, 12.4.2).

OdDAI.Logical.op_LogicalNot
\details
NOT operator implementation for Logical type (ISO 10303-11, 12.4.1).

OdDAI.Logical.nullify
\details
Changes Logical instance to unset state.

OdDAI.Logical.exists
\details
Checks whether Logical instance has been set.
\returns 0 if Logical instance is unset, otherwise returns 1

OdDAI.Logical.#ctor
\details
Default constructor

OdDAI.Logical
\details
Class represents SDAI primitive type Logical.